# Журнал обновлений
### *О чём это?*
Главная задача этого файла заключается в том, чтобы показать прогресс нашего проекта "Sarayashiki". Здесь мы переодически сообщаем об исправлениях багов, добавлений новых функций и обновлениях версии. Все новвоведения будут задокументироованы ниже

## 26.04.2025
### Исправили:
- Баги, из-за которых игрок может вылететь из арены
- Полировка вражеского ИИ
![](https://github.com/AcidKoujou/university-practice-2025/blob/main/images/1.png)

### Добавили:
- Новый HUD-бар!
